# Цілі числа (int)
a = 5
b = -3
c = 0

# Операції з цілими числами:
total = a + b  # Додавання 'a' та 'b' і результат присвоюється змінній 'total'
diff = a - b   # Віднімання 'b' від 'a' і результат присвоюється змінній 'diff'
prod = a * b   # Множення 'a' на 'b' і результат присвоюється змінній 'prod'
div1 = a / b   # Ділення 'a' на 'b' і результат присвоюється змінній 'div1'
div2 = a // b  # Цілочисельне ділення 'a' на 'b' і результат присвоюється змінній 'div2'
mod = a % b    # Залишок від ділення 'a' на 'b' і результат присвоюється змінній 'mod'
exp = a ** b   # Піднесення 'a' до ступеня 'b' і результат присвоюється змінній 'exp'


# Дійсні числа (float)
x = 3.14
y = -0.5
z = 0.0

# Операції з дійсними числами аналогічні до операцій з цілими числами.

print("Цілі числа:")
print(f"a + b = {total}")
print(f"a - b = {diff}")
print(f"a * b = {prod}")
print(f"a / b = {div1}")
print(f"a // b = {div2}")
print(f"a % b = {mod}")
print(f"a ** b = {exp}")

print("\nДійсні числа:")
print(f"x + y = {x + y}")
print(f"x - y = {x - y}")
print(f"x * y = {x * y}")
print(f"x / y = {x / y}")