# Приклади використання функції input()

# Функція input() дозволяє користувачу ввести дані з клавіатури і зберегти їх у змінну.
# Користувач вводить дані та натискає Enter.

# Приклад 1: Отримання рядка від користувача
name = input("Введіть своє ім'я: ")
print(f"Привіт, {name}!")

# Приклад 2: Отримання числа від користувача та конвертація до цілого числа
age_str = input("Скільки вам років? ")
age = int(age_str)
print(f"Через {100 - age} років вам виповниться 100 років")

# Приклад 3: Отримання числа з десятковою комою від користувача та конвертація до числа з плаваючою точкою
height_str = input("Якого зросту ви? (у метрах) ")
height = float(height_str)
print(f"Ви високі на {height} метра(ів).")

# Приклади використання функції print() і форматування виводу

# Функція print() виводить дані на екран.

# Приклад 1: Виведення змінної та рядка
name = "John"
print("Привіт, " + name)

# Приклад 2: Використання f-строк для вставки значень змінних у рядок
age = 25
name = "Alice"
print(f"{name} є {age} років стара.")

# Приклад 3: Виведення чисел та результатів математичних операцій
a = 5
b = 3
print(f"{a} + {b} = {a + b}")
print(f"{a} - {b} = {a - b}")
print(f"{a} * {b} = {a * b}")
print(f"{a} / {b} = {a / b:.2f}")  # Виведе результат з точністю до двох знаків після коми
