# Функція max - знаходить максимальний елемент в ітерабельному об'єкті
numbers = (3, 1, 4, 1, 5, 9, 2, 6, 5, 3, 5)
max_number = max(numbers)
print(f"Максимальний елемент: {max_number}")

# Функція min - знаходить мінімальний елемент в ітерабельному об'єкті
min_number = min(numbers)
print(f"Мінімальний елемент: {min_number}")

# Функція sum - обчислює суму всіх елементів в ітерабельному об'єкті
total = sum(numbers)
print(f"Сума елементів: {total}")

# Функція int - конвертує рядок або число у ціле число
num_str = "123"
num_int = int(num_str)
print(f"Конвертація рядка у ціле число: {num_int}")
num_float = 3.2
num_int_2 = int(num_float)
print(f"Конвертація числa з плаваючою точкою у ціле число: {num_int}")


# Функція float - конвертує рядок або число у число з плаваючою точкою
num_str = "3.14"
num_float = float(num_str)
print(f"Конвертація рядка у число з плаваючою точкою: {num_float}")


# Функція abs - повертає абсолютне значення числа
num = -5
abs_num = abs(num)
print(f"Абсолютне значення числа: {abs_num}")