# Рядки в Python індексуються, тобто кожен символ має свій номер. Індексація починається з 0.
# Ви також можете використовувати від'ємні індекси для доступу до символів з кінця рядка.


text = "Python"
char = text[0]    # char = 'P'
last_char = text[-1]  # last_char = 'n'



# Slices
#Зрізи дозволяють вам отримувати підрядок з рядка. Вони визначаються двома індексами (початковий та кінцевий)
# і використовуються наступним чином:

text1 = "Python"
substring = text[0:3]  # substring = "Pyt" (включаючи індекс 0, але не включаючи індекс 3)
reversed = text1[::-1]

print(reversed)
